1.Introduction
This assignment will help you to consolidate the concepts learnt in the session.
2.Problem Statement

It happens all the time: someone gives you data containing malformed strings,
Python, lists and missing data. How do you tidy it up so you can get on with the
analysis?
Take this monstrosity as the DataFrame to use in the following puzzles:
df = pd.DataFrame({'From_To': ['LoNDon_paris', 'MAdrid_miLAN',
'londON_StockhOlm',

'Budapest_PaRis', 'Brussels_londOn'],
'FlightNumber': [10045, np.nan, 10065, np.nan, 10085],
'RecentDelays': [[23, 47], [], [24, 43, 87], [13], [67, 32]],
'Airline': ['KLM(!)', '<Air France> (12)', '(British Airways. )',
'12. Air France', '"Swiss Air"']})

1. Some values in the the FlightNumber column are missing. These numbers are
meant to increase by 10 with each row so 10055 and 10075 need to be put in
place. Fill in these missing numbers and make the column an integer column
(instead of a float column).
2. The From_To column would be better as two separate columns! Split each
string on the underscore delimiter _ to give a new temporary DataFrame with
the correct values. Assign the correct column names to this temporary
DataFrame.
3. Notice how the capitalisation of the city names is all mixed up in this
temporary DataFrame. Standardise the strings so that only the first letter is
uppercase (e.g. "londON" should become "London".)
4. Delete the From_To column from df and attach the temporary DataFrame
from the previous questions.
5. In the RecentDelays column, the values have been entered into the
DataFrame as a list. We would like each first value in its own column, each

second value in its own column, and so on. If there isn't an Nth value, the value
should be NaN.
Expand the Series of lists into a DataFrame named delays, rename the columns
delay_1, delay_2, etc. and replace the unwanted RecentDelays column in df
with delays.

In [1]:
import pandas as pd
import numpy as np
df = pd.DataFrame({'From_To': ['LoNDon_paris', 'MAdrid_miLAN', 'londON_StockhOlm',
                               'Budapest_PaRis', 'Brussels_londOn'],
                   'FlightNumber': [10045, np.nan, 10065, np.nan, 10085],
                   'RecentDelays': [[23, 47], [], [24, 43, 87], [13], [67, 32]], 
                   'Airline': ['KLM(!)', ' (12)', '(British Airways. )', '12. Air France', '"Swiss Air"']
                  })
df

            From_To  FlightNumber  RecentDelays              Airline
0      LoNDon_paris       10045.0      [23, 47]               KLM(!)
1      MAdrid_miLAN           NaN            []                 (12)
2  londON_StockhOlm       10065.0  [24, 43, 87]  (British Airways. )
3    Budapest_PaRis           NaN          [13]       12. Air France
4   Brussels_londOn       10085.0      [67, 32]          "Swiss Air"

## TASK1.
Some values in the the FlightNumber column are missing. These numbers are meant to increase by 10 with each row so 10055 and 10075 need to be put in place. Fill in these missing numbers and make the column an integer column (instead of a float column).

In [2]:
index = df.index
index

RangeIndex(start=0, stop=5, step=1)

In [3]:
condition = df['FlightNumber'].isnull() == True
condition

0    False
1     True
2    False
3     True
4    False
Name: FlightNumber, dtype: bool

In [4]:
nan_index  = index[condition]
l = list(nan_index)
l

[1, 3]

In [5]:
num = [10055,10075]
for i,j in zip(l,num):
    df['FlightNumber'][i] = j

<ipython-input-5-0b5ce42a687b>:3: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df['FlightNumber'][i] = j

In [6]:
df

            From_To  FlightNumber  RecentDelays              Airline
0      LoNDon_paris       10045.0      [23, 47]               KLM(!)
1      MAdrid_miLAN       10055.0            []                 (12)
2  londON_StockhOlm       10065.0  [24, 43, 87]  (British Airways. )
3    Budapest_PaRis       10075.0          [13]       12. Air France
4   Brussels_londOn       10085.0      [67, 32]          "Swiss Air"

In [7]:
# Second way to fill nan values woth different values 
import pandas as pd
import numpy as np
data = pd.DataFrame({'From_To': ['LoNDon_paris', 'MAdrid_miLAN', 'londON_StockhOlm',
                               'Budapest_PaRis', 'Brussels_londOn'],
                   'FlightNumber': [10045, np.nan, 10065, np.nan, 10085],
                   'RecentDelays': [[23, 47], [], [24, 43, 87], [13], [67, 32]], 
                   'Airline': ['KLM(!)', ' (12)', '(British Airways. )', '12. Air France', '"Swiss Air"']
                  })
data

            From_To  FlightNumber  RecentDelays              Airline
0      LoNDon_paris       10045.0      [23, 47]               KLM(!)
1      MAdrid_miLAN           NaN            []                 (12)
2  londON_StockhOlm       10065.0  [24, 43, 87]  (British Airways. )
3    Budapest_PaRis           NaN          [13]       12. Air France
4   Brussels_londOn       10085.0      [67, 32]          "Swiss Air"

In [8]:
nan_val = np.where(data['FlightNumber'].isnull() == True)
index_nan_val = list(nan_val)
index_nan_val

[array([1, 3])]

In [9]:
ind = list(data.iloc[nan_val].index)

In [10]:
for i,j in zip(ind,num):
    data['FlightNumber'][i] = j

<ipython-input-10-1990b2f54150>:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  data['FlightNumber'][i] = j

In [11]:
data

            From_To  FlightNumber  RecentDelays              Airline
0      LoNDon_paris       10045.0      [23, 47]               KLM(!)
1      MAdrid_miLAN       10055.0            []                 (12)
2  londON_StockhOlm       10065.0  [24, 43, 87]  (British Airways. )
3    Budapest_PaRis       10075.0          [13]       12. Air France
4   Brussels_londOn       10085.0      [67, 32]          "Swiss Air"

In [12]:
# convert float to integer 
df['FlightNumber'] = df['FlightNumber'].astype(int)

In [13]:
df['FlightNumber'].dtype

dtype('int64')

## TASK2.
The From_To column would be better as two separate columns! Split each string on the underscore delimiter _ to give a new temporary DataFrame with the correct values. Assign the correct column names to this temporary DataFrame.

In [14]:
tmp_str = []
finaal_list1 = []
finaal_list2 = []
for i in df['From_To']:
    tmp_str.append(i.split('_'))
tmp_str
for i in tmp_str:
    finaal_list1.append(i[0])
    finaal_list2.append(i[1])
finaal_list1

['LoNDon', 'MAdrid', 'londON', 'Budapest', 'Brussels']

In [15]:
finaal_list2

['paris', 'miLAN', 'StockhOlm', 'PaRis', 'londOn']

In [16]:
df['City_From'] = finaal_list1
df['City_To'] = finaal_list2

In [17]:
df

,From_To,FlightNumber,RecentDelays,Airline,City_From,City_To
0,LoNDon_paris,10045,"[23, 47]",KLM(!),LoNDon,paris
1,MAdrid_miLAN,10055,[],(12),MAdrid,miLAN
2,londON_StockhOlm,10065,"[24, 43, 87]",(British Airways. ),londON,StockhOlm
3,Budapest_PaRis,10075,[13],12. Air France,Budapest,PaRis
4,Brussels_londOn,10085,"[67, 32]","""Swiss Air""",Brussels,londOn

## Task3
Notice how the capitalisation of the city names is all mixed up in this temporary DataFrame. Standardise the strings so that only the first letter is uppercase (e.g. "londON" should become "London".)

In [18]:
City_From = []
City_To = []
for i,j in zip(df['City_From'], df['City_To']):
 
    a = i[0].upper()
    aa = j[0].upper()
   
  
    b = i[1::].lower()
    bb = j[1::].lower()
        
    from_name = a +b
    to_name = aa+bb
#     print(from_name)
#     print(to_name)
    City_From.append(a+b)
    City_To.append(aa+bb)
    
print(City_From)
print(City_To)

['London', 'Madrid', 'London', 'Budapest', 'Brussels']
['Paris', 'Milan', 'Stockholm', 'Paris', 'London']

In [19]:
df['City_From'] = City_From
df['City_To'] = City_To
df

,From_To,FlightNumber,RecentDelays,Airline,City_From,City_To
0,LoNDon_paris,10045,"[23, 47]",KLM(!),London,Paris
1,MAdrid_miLAN,10055,[],(12),Madrid,Milan
2,londON_StockhOlm,10065,"[24, 43, 87]",(British Airways. ),London,Stockholm
3,Budapest_PaRis,10075,[13],12. Air France,Budapest,Paris
4,Brussels_londOn,10085,"[67, 32]","""Swiss Air""",Brussels,London

## Task 4.
Delete the From_To column from df and attach the temporary DataFrame from the previous questions

In [20]:
df.drop('From_To', axis=1, inplace=True)

In [21]:
df

   FlightNumber  RecentDelays              Airline City_From    City_To
0         10045      [23, 47]               KLM(!)    London      Paris
1         10055            []                 (12)    Madrid      Milan
2         10065  [24, 43, 87]  (British Airways. )    London  Stockholm
3         10075          [13]       12. Air France  Budapest      Paris
4         10085      [67, 32]          "Swiss Air"  Brussels     London

## TASK 5.
In the RecentDelays column, the values have been entered into the DataFrame as a list. We would like each first value in its own column, each
second value in its own column, and so on. If there isn't an Nth value, the value should be NaN. Expand the Series of lists into a DataFrame named delays, rename the columns delay_1, delay_2, etc. and replace the unwanted RecentDelays column in df with delays.

In [22]:
df['RecentDelays']

0        [23, 47]
1              []
2    [24, 43, 87]
3            [13]
4        [67, 32]
Name: RecentDelays, dtype: object

In [23]:
length = len(df['RecentDelays'])
greater_length = ''
first = df['RecentDelays'][0]
for i in range(1,length):
    second = df['RecentDelays'][i]
    if len(first)> len(second):
        greater_length = first
    if len(first)< len(second):
        first = second
        greater_length = first
print(first)

[24, 43, 87]

In [24]:
len(df['RecentDelays'])

5

In [25]:
lrn_list = []
for i in range(length):
    lrn_list.append(len(df['RecentDelays'][i]))

In [26]:
max(lrn_list)

3

In [27]:
for i in range(length):
    list_len = len(df['RecentDelays'][i])
    if list_len < 3:
        a = 3-list_len
        for j in range(3-list_len):
            df['RecentDelays'][i].append(np.nan)

1 ********
3 ********
2 ********
1 ********

In [28]:
df

   FlightNumber     RecentDelays              Airline City_From    City_To
0         10045    [23, 47, nan]               KLM(!)    London      Paris
1         10055  [nan, nan, nan]                 (12)    Madrid      Milan
2         10065     [24, 43, 87]  (British Airways. )    London  Stockholm
3         10075   [13, nan, nan]       12. Air France  Budapest      Paris
4         10085    [67, 32, nan]          "Swiss Air"  Brussels     London

In [37]:
data_final_list = []
for lis in df['RecentDelays']:
    data_final_list.append(lis)
print(data_final_list)

[[23, 47, nan], [nan, nan, nan], [24, 43, 87], [13, nan, nan], [67, 32, nan]]

In [39]:
delay_1 = []
delay_2 = []
delay_3 = []
for i in range(length):
    delay_1.append(data_final_list[i][0])
    delay_2.append(data_final_list[i][1])
    delay_3.append(data_final_list[i][2])
print(delay_1, '*******')
print(delay_2, '&&&&&&&')
print(delay_3, '$$$$$$$')

[23, nan, 24, 13, 67] *******
[47, nan, 43, nan, 32] &&&&&&&
[nan, nan, 87, nan, nan] $$$$$$$

In [40]:
df['delay_1'] = delay_1
df['delay_2'] = delay_2
df['delay_3'] = delay_3
df

,FlightNumber,RecentDelays,Airline,City_From,City_To,delay_1,delay_2,delay_3
0,10045,"[23, 47, nan]",KLM(!),London,Paris,23.0,47.0,NaN
1,10055,"[nan, nan, nan]",(12),Madrid,Milan,NaN,NaN,NaN
2,10065,"[24, 43, 87]",(British Airways. ),London,Stockholm,24.0,43.0,87.0
3,10075,"[13, nan, nan]",12. Air France,Budapest,Paris,13.0,NaN,NaN
4,10085,"[67, 32, nan]","""Swiss Air""",Brussels,London,67.0,32.0,NaN

In [41]:
df.drop('RecentDelays', axis=1, inplace=True)
df

,FlightNumber,Airline,City_From,City_To,delay_1,delay_2,delay_3
0,10045,KLM(!),London,Paris,23.0,47.0,NaN
1,10055,(12),Madrid,Milan,NaN,NaN,NaN
2,10065,(British Airways. ),London,Stockholm,24.0,43.0,87.0
3,10075,12. Air France,Budapest,Paris,13.0,NaN,NaN
4,10085,"""Swiss Air""",Brussels,London,67.0,32.0,NaN

## Final Data is Look lIke that